/*********************************************************************************************************
**				                               Small RTOS(51)
**                                   The Real-Time Kernel(For Keil c51)
**
**                                  (c) Copyright 2002-2003, chenmingji
**                                           All Rights Reserved
**
**                                                  V1.20.0
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: null.c
**创   建   人: cole3
**最后修改日期: 2003年8月3日
**描        述: ext1源代码。
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: cole3
** 版  本: V0.50
** 日　期: 2013年4月6日
** 描　述: 原始版本
********************************************************************************************************/
#include "null.h"

static int8 null_open(uint8 id)
{
	UNUSED(id);
	return 0;
}

static void null_close(uint8 id)
{
	UNUSED(id);
}

static int8 null_ioctl(uint8 id, uint8 cmd, uint16 args)
{
	UNUSED(id);
	UNUSED(cmd);
	UNUSED(args);
	return 0;
}


const struct file_operations null_fops = {
	null_open,
	null_close,
	null_ioctl
};

/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
