/*********************************************************************************************************
**				                               Small RTOS(51)
**                                   The Real-Time Kernel(For Keil c51)
**
**                                  (c) Copyright 2002-2003, chenmingji
**                                           All Rights Reserved
**
**                                                  V1.20.0
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: uart.h
**创   建   人: cole3
**最后修改日期: 2003年8月3日
**描        述: ext1源代码。
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: cole3
** 版  本: V0.50
** 日　期: 2013年4月6日
** 描　述: 原始版本
********************************************************************************************************/
#ifndef _UART_H_
#define _UART_H_

#include "drivers.h"

#define MAX_UART		1
#define UART_SEND_TIMEOUT		10000


#define UART_SEND_Q_SIZE		32
#define UART_SEND_TIMEOUT_TICKS	10
#define UART_RCV_Q_SIZE			16

extern const struct file_operations uart_fops;

#endif //_NULL_H_
/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
